app/controllers/api/spots_controller.rb

SELECT "spots".* FROM "spots"
---
  def index
    @spots = Spot.all

SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @spot = Spot.find(params[:id])

INSERT INTO "spots" ("address", "city", "lat", "lng", "description", "price", "host_id", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    # debugger
    @spot = Spot.new(spot_params)
    # debugger
    if @spot.save

SELECT  "spots".* FROM "spots" WHERE "spots"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "spots" SET "title" = $1, "updated_at" = $2 WHERE "spots"."id" = $3  [["title", "pretty plus plus salon"], ["updated_at", "2020-02-12 21:44:35.391037"], ["id", 5]]
---
  def update
    # debugger
    @spot = Spot.find(params[:id])
    # debugger
    if @spot.update(spot_params)