app/models/user.rb

  def reset_session_tojen!
    self.session_token = self.class.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "IHjqHdGI9yawj3xOzacfUg"], ["updated_at", "2020-02-11 00:28:30.151713"], ["id", 3]]